//Всем привет!
//Покритикуйте код ниже - можно ли так программировать?
//А если да, то забирайте в пользование
//Я использую для формирования строки кода функцию "СтрШаблон", так как у меня в тексте меняется только "Дт" или "Кт" и это позволяет не дублировать код
//Вопрос к экспертам по производительности и вообще по внутренностям 1с - насколько так допустимо писать.

Процедура ОтразитьДанныеОперативногоУчетаРекурсивно_ЗаполнитьПодразделение(Знач Данные, Знач ИспользоватьФиксЗначенияИзмеренийВПроводкахМСФО, Знач ИсточникиПодразделений, Знач Проводка, Знач ШаблонПроводки,ВидДвижения)
	
	Если ИспользоватьФиксЗначенияИзмеренийВПроводкахМСФО = истина тогда
		
		ТекстУстановкиПодразделения = СтрШаблон("Проводка.Подразделение%1 =?(ЗначениеЗаполнено(ШаблонПроводки.ШаблонПроводки.Подразделение%1Фикс),
		|ШаблонПроводки.ШаблонПроводки.Подразделение%1Фикс,ЗначениеИзмерения(Данные, ИсточникиПодразделений, ШаблонПроводки.ИсточникПодразделения%1));",ВидДвижения);			
		Иначе	
		ТекстУстановкиПодразделения = СтрШаблон("Проводка.Подразделение%1 = ЗначениеИзмерения(Данные, ИсточникиПодразделений, ШаблонПроводки.ИсточникПодразделения%1);",ВидДвижения); 
	КонецЕсли;
	
	Выполнить(ТекстУстановкиПодразделения);

	
КонецПроцедуры

