//Как узнать все роли на чтение всех регистраторов какого-то регистра.
//В 8й строке заменить - имя регистра на нужный. Если нужен регсведений или бухгалтерии соответственно прописать нужный текст

//Чтобы увидеть на экране - расскоментировать строку 21 //Сообщить(роль.имя); - можно использовать в консоли кода.
//Может пригодится при переходе на версию 2.5, когда нужно настраивать новые профили -например для отчетов, которые формируются запросом к регистру.


ВыражениеРегистра = "Метаданные.РегистрыНакопления."+ИмяРегистра;
РН = Вычислить(ВыражениеРегистра);
Регистраторы = РН.СтандартныеРеквизиты.Регистратор.Тип;
//Сообщить(Регистраторы.Типы());
МассивТипов = Регистраторы.Типы();
мСписокЗнч = Новый СписокЗначений;
мСписокЗнч.ЗагрузитьЗначения(МассивТипов);
мСписокЗнч.СортироватьПоЗначению(НаправлениеСортировки.Возр);
 
Для каждого роль Из метаданные.Роли Цикл
     
     
    Для каждого тип из мСписокЗнч цикл
        //сообщить(тип); 
        ДокументСсылка = Новый(тип.Значение);
        Имя = Документссылка.Метаданные().Имя;
        ИмяДокументаТекстом = "метаданные.документы."+Имя;
        ДокМетаданные = Вычислить(ИмяДокументаТекстом);
        ЕстьПраво =ПравоДоступа("Чтение",ДокМетаданные,роль);
        Если ЕстьПраво и Лев(роль.Имя,6)="Чтение" Тогда
             
            //Сообщить(роль.имя);  
            МассивИменРолей.добавить(Роль.Имя);
             
        КонецЕсли;
         
    Конеццикла;
     
     
КонецЦикла;
