
ВЫБРАТЬ
	ПрофилиГруппДоступаРоли.Ссылка КАК Профиль,
	ГруппыДоступа.Ссылка КАК ГруппаДоступа
ПОМЕСТИТЬ ВТ_ПрофилиИГД
ИЗ
	Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		ПО (ПрофилиГруппДоступаРоли.Ссылка = ГруппыДоступа.Профиль)
ГДЕ
	ПрофилиГруппДоступаРоли.Роль = &Роль
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ПрофилиИГД.Профиль КАК Профиль,
	ВТ_ПрофилиИГД.ГруппаДоступа КАК ГруппаДоступа,
	ВЫБОР
		КОГДА ПрофилиГруппДоступаВидыДоступа.Ссылка ССЫЛКА Справочник.ПрофилиГруппДоступа
			ТОГДА "Да"
		ИНАЧЕ "нет"
	КОНЕЦ КАК ОграничениеОрганизация,
	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГруппыДоступаПользователи.Пользователь) КАК ЧислоПользователей
ИЗ
	ВТ_ПрофилиИГД КАК ВТ_ПрофилиИГД
		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.ВидыДоступа КАК ПрофилиГруппДоступаВидыДоступа
		ПО (ВТ_ПрофилиИГД.Профиль = ПрофилиГруппДоступаВидыДоступа.Ссылка)
			И (ПрофилиГруппДоступаВидыДоступа.ВидДоступа ССЫЛКА Справочник.Организации)
		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		ПО (ВТ_ПрофилиИГД.ГруппаДоступа = ГруппыДоступаПользователи.Ссылка)

СГРУППИРОВАТЬ ПО
	ВТ_ПрофилиИГД.Профиль,
	ВТ_ПрофилиИГД.ГруппаДоступа,
	ВЫБОР
		КОГДА ПрофилиГруппДоступаВидыДоступа.Ссылка ССЫЛКА Справочник.ПрофилиГруппДоступа
			ТОГДА "Да"
		ИНАЧЕ "нет"
	КОНЕЦ

ИМЕЮЩИЕ
	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГруппыДоступаПользователи.Пользователь) <> 0
